<?php

return [
    'EN' => [
        'consonants' => [
            'b', 'c', 'd', 'f', 'g', 'h', 'j', 'k', 'l', 'm', 'n', 'p', 'q', 'r', 's', 't', 'v', 'w', 'x', 'y', 'z'
        ],
        'vowels' => [
            'a', 'e', 'i', 'o', 'u'
        ]
    ],
    'RU' => [
        'consonants' => [
            'б', 'в', 'г', 'д', 'ж', 'з', 'й', 'к', 'л', 'м', 'н', 'п', 'р', 'с', 'т', 'ф', 'х', 'ц', 'ч', 'ш', 'щ'
        ],
        'vowels' => [
            'а', 'у', 'о', 'ы', 'и', 'э', 'я', 'ю', 'ё', 'е'
        ]
    ]
];