<?php

use System\Inc\FileIni;
use System\ENV\AppEnv;

/**
 * »»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»
 * «_________________________ПОДКЛЮЧЕНИЕ АВТО ЛОАДЕР КЛАССОВ__________________________»
 * ««««««««««««««««««««««««««««««««««««««««««««««««««««««««««««««««««««««««««««««««««««
 */
require __DIR__ .'/../vendor/autoload.php';

/**
 * »»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»
 * «_______________________ПОДКЛЮЧЕНИЕ ВСЕХ ОСНОВНЫХ ФУЦНКЦИЙ_________________________»
 * ««««««««««««««««««««««««««««««««««««««««««««««««««««««««««««««««««««««««««««««««««««
 */
require __DIR__ . '/../system/libs/function-codememory.php';

/**
 * »»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»
 * «________________________ПОДКЛЮЧЕНИЕ ФАЙЛА CM КОНФИГУРАЦИИ_________________________»
 * ««««««««««««««««««««««««««««««««««««««««««««««««««««««««««««««««««««««««««««««««««««
 */
require include_cm('config/Codememory/configuration', '../');

$ini = new FileIni();

/**
 * »»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»
 * «_______________НАСТРОЙКА ЛОГОВ ВКЛЮЧЕНИЕ/ВЫКЛЮЧЕНИЕ И ЗАПИСЬ В ФАЙЛ_______________»
 * ««««««««««««««««««««««««««««««««««««««««««««««««««««««««««««««««««««««««««««««««««««
 */
$enableError = function($status) use ($ini, $write_log)
{

    if($write_log['enable'] === true) $ini->setCfg('error_log', '../'.$write_log['path']);

    $ini->setCfg('display_errors', $status);
    $ini->setCfg('display_startup_errors', $status);
    $ini->setCfg('log_errors', $status);
    
};

$enableError(($enable_debug === true) ? 'On' : 'Off');


/**
 * »»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»»
 * «_______________ОСНОВНОЙ ФАЙЛ, В КОТОРОМ НАЧИНАЕТСЯ ВСЯ ЦЕПОЧКА____________________»
 * ««««««««««««««««««««««««««««««««««««««««««««««««««««««««««««««««««««««««««««««««««««
 */
require_once '../server.php';



